Revit 2024 API
BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationWarning Property
 Cannot create specified fillet at rail path corner.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ContinuousRailFilletCreationWarning { get; }
Visual Basic
Public Shared ReadOnly Property ContinuousRailFilletCreationWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ContinuousRailFilletCreationWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace